{
  "backend/main.mo": "Motoko backend defining profiles, achievements with verification workflow, access control, and storage mixins.",
  "feature_evidence.json": "Empty feature evidence report container.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend source files.",
  "frontend/DEPLOYMENT.md": "Deployment runbook outlining pre-deployment checks and build steps.",
  "frontend/index.css": "Tailwind base and theme variables defining light/dark color tokens and global styles.",
  "frontend/index.html": "Root HTML file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React router setup with theme provider, auth gate, app shell, and route definitions.",
  "frontend/src/components/AchievementDetailPanel.tsx": "Displays full achievement details including certificate image, links, metadata, and verification history.",
  "frontend/src/components/AchievementForm.tsx": "Form for creating or editing achievements with link management and certificate image upload/preview.",
  "frontend/src/components/AppShell.tsx": "Defines the main application layout with navigation, theming controls, and responsive sidebar.",
  "frontend/src/components/AuthGate.tsx": "Wraps protected content, handling authentication, profile loading, errors, and login flow.",
  "frontend/src/components/AuthStatusButton.tsx": "Shows the authenticated user's avatar menu with profile info and logout option.",
  "frontend/src/components/ErrorBanner.tsx": "Displays an error alert with a title and message when an error is provided.",
  "frontend/src/components/ProfileSetupModal.tsx": "Provides a form modal for creating or completing a user profile with role-specific fields.",
  "frontend/src/components/SearchResultsList.tsx": "Renders a list of achievement search results with metadata and a detail view trigger.",
  "frontend/src/components/VerificationActions.tsx": "Offers verify and reject controls for achievements with a confirmation dialog and notes.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication, including loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating profiles and achievements via the backend actor.",
  "frontend/src/index.css": "Configures Tailwind base, component, and utility layers with custom theming variables and UI helper classes.",
  "frontend/src/lib/buildInfo.ts": "Supplies build metadata via environment variables and formats it for display.",
  "frontend/src/lib/chatbotParser.ts": "Parses natural language prompts into structured achievement search filters, returning either filters or clarification requests.",
  "frontend/src/lib/chatbotSearch.ts": "Executes achievement searches based on parsed chatbot filters, applying prioritized and additional filtering.",
  "frontend/src/lib/errors.ts": "Normalizes unknown or backend errors into user‑friendly error messages.",
  "frontend/src/lib/file.ts": "Converts browser File objects to Uint8Array buffers and checks if uploaded files are images.",
  "frontend/src/lib/permissions.ts": "Implements role-based permission checks for verifying and editing achievements.",
  "frontend/src/lib/utils.ts": "Contains UI and data helpers such as class merging, date formatting, and category/status label utilities.",
  "frontend/src/lib/validation.ts": "Provides input validation functions for student IDs, names, emails, titles, and descriptions.",
  "frontend/src/main.tsx": "Bootstraps the React app with react-query and the Internet Identity provider, rendering the root App component.",
  "frontend/src/pages/AchievementsPage.tsx": "Displays, filters, creates, and verifies student achievements with detail panels and form dialogs.",
  "frontend/src/pages/ChatbotPage.tsx": "Implements an AI assistant UI that parses user queries and returns filtered achievement results.",
  "frontend/src/pages/DashboardPage.tsx": "Shows a personalized dashboard with stats, role-based messaging, and quick navigation for users.",
  "frontend/src/pages/ProfilePage.tsx": "Allows users to view and edit their profile information with form validation and save functionality.",
  "frontend/src/pages/SearchPage.tsx": "Provides search tools for achievements by student ID or text keywords with result lists and detail panels.",
  "frontend/src/pages/VerificationQueuePage.tsx": "Renders the achievement verification queue, handling access control, loading states, list display, and verification actions via a detail dialog.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and managing hash-based query values.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, fonts, animations, and plugin setup.",
  "project_state.json": "Stores project metadata, feature requests, and notes about the current Motoko compilation issue to be fixed."
}