{
  "backend/main.mo": "Defines the backend canister with access control, profile management, achievement storage and verification logic, plus Gemini API key handling for AI chat features.",
  "feature_evidence.json": "Lists feature evidence mapping features to related files, components, and test IDs for project documentation.",
  "frontend-file-summaries.txt": "Contains prewritten one‑line summaries for numerous frontend files describing their purpose and functionality.",
  "frontend/.env.example": "Provides an example environment file documenting secure Gemini API key configuration for backend‑only use.",
  "frontend/DEPLOYMENT.md": "Deployment guide covering environment setup, Gemini API key configuration, build steps, verification, and troubleshooting.",
  "frontend/docs/gemini-chatbot.md": "Documentation overview describing the Gemini AI chatbot integration and high‑level architecture.",
  "frontend/index.css": "Global Tailwind CSS setup defining base styles and OKLCH color variables for light and dark themes.",
  "frontend/index.html": "HTML entrypoint loading the React application and defining metadata and root element.",
  "frontend/src/App.tsx": "Main React router configuration wrapping routes with theme provider, auth gate, and application shell.",
  "frontend/src/components/AchievementDetailPanel.tsx": "Displays detailed information for an achievement including metadata, certificate image, links, and verification history.",
  "frontend/src/components/AchievementForm.tsx": "Form for creating or editing achievements with fields, link management, image upload, and submission handling.",
  "frontend/src/components/AppShell.tsx": "Main application layout providing header, navigation, theme switching, and container for page content.",
  "frontend/src/components/AuthGate.tsx": "Manages authentication flow, showing loading, error, login, or protected content based on user state.",
  "frontend/src/components/AuthStatusButton.tsx": "User profile dropdown showing initials, profile info, and logout option when authenticated.",
  "frontend/src/components/ErrorBanner.tsx": "Reusable error alert component displaying a title and error message.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for initial user profile setup with fields for name, email, role, and optional student info.",
  "frontend/src/components/SearchResultsList.tsx": "Renders a list of achievement cards with category, status, description, date, and student info, and allows viewing details.",
  "frontend/src/components/VerificationActions.tsx": "Provides verify/reject buttons with a dialog to submit notes and trigger verification actions for an achievement.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages a backend actor based on the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Handles Internet Identity authentication, storing identity state, login flow, and providing identity context to the app.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating profiles and achievements through the backend actor.",
  "frontend/src/index.css": "Sets up Tailwind styles, color variables for light/dark themes, and shared UI utility classes.",
  "frontend/src/lib/buildInfo.ts": "Supplies build metadata such as version, timestamp, and environment and formats it for display.",
  "frontend/src/lib/chatbotParser.ts": "Parses natural‑language prompts to extract filters like student ID, category, year, and search terms for achievement queries.",
  "frontend/src/lib/chatbotSearch.ts": "Implements prioritized achievement search logic using filters like student ID, category, text, year, and returns filtered results.",
  "frontend/src/lib/errors.ts": "Normalizes various backend and Gemini-related errors into user-friendly messages.",
  "frontend/src/lib/file.ts": "Provides utilities to convert browser File objects to Uint8Array and to detect image MIME types.",
  "frontend/src/lib/permissions.ts": "Defines role-based permission checks for verifying and editing achievements.",
  "frontend/src/lib/utils.ts": "Contains UI helpers for class merging, date formatting, category labels, and status color mapping.",
  "frontend/src/lib/validation.ts": "Validates common input fields such as student ID, name, email, title, and description.",
  "frontend/src/main.tsx": "Initializes React app with query client and Internet Identity provider, then renders the root component.",
  "frontend/src/pages/AchievementsPage.tsx": "Displays user achievements, supports creating, viewing, and verifying achievements, and manages related UI state.",
  "frontend/src/pages/ChatbotPage.tsx": "Implements a chat interface using Gemini, handling message flow, context building, and error display.",
  "frontend/src/pages/DashboardPage.tsx": "Renders dashboard with user-specific stats, welcome message, and shortcuts based on role and achievements.",
  "frontend/src/pages/ProfilePage.tsx": "Profile management page allowing users to view and edit their name, email, and bio with loading states and role labels.",
  "frontend/src/pages/SearchPage.tsx": "Achievement search interface supporting student ID and keyword queries, displaying results and achievement details in a dialog.",
  "frontend/src/pages/VerificationQueuePage.tsx": "Admin/professor page listing achievements pending verification with detail view and verify/reject actions.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL and sessionStorage parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, fonts, animations, and content paths.",
  "project_state.json": "Project metadata describing architecture goals, feature requirements, and pending work for integrating Gemini-powered chatbot functionality."
}